// Напишите программу, которая принимает на ход три числа и выдает максимальное из этих чисел
// 2,3,7 
// 44 5 78
// 22 3 9

Console.WriteLine("Hello, World!");
